'''
5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
'''
import sys
my_list = [7, 5, 3, 3, 2]

while True:

    new_list_number = input(
        'Please enter any number, to exit type exit:\n>>> ')
    if new_list_number == 'exit':
        sys.exit()
    new_list_number = int(new_list_number)
    my_list.append(new_list_number)

    my_list.sort(reverse=True)

    print(my_list)
